{
  "typedStrings": ["A website.", "A 3D model.", "A mobile app.", "A game."],
  "cappuccino-theme": "☕ &nbsp;Cappuccino theme",
  "cioccolato-theme": "🍫 &nbsp;Cioccolato theme",
  "high-contrast-theme": "👁️‍🗨️ &nbsp;High Contrast theme",
  "home-header": "Home",
  "home-phrase": "What can I do for you?",
  "first-tip": "Tip: There are some themes that can be chosen in the header, including a high-contrast one.",

  "about-header": "About",
  "about-section-title": "About Me",
  "resume-word": "Resume",
  "long-history-word": "Long History...",
  "resume-text": "<p>I'm Douglas Guimarães, 20 years old, and I'm from Juiz de Fora, MG, Brazil. I'm currently majoring in Information Systems at Estácio de Sá. </p><p>I have had a passion for programming since I was 16, and in the past 2 years, I have been working as a freelancer, honing my professional skills. I am a Fullstack developer and work on various types of projects, from 3D modeling to mobile app development (see the 'skills' section to understand the technologies I use).</p><p>I have also participated in and created some open-source projects (you can find their code on my GitHub). Feel free to get in touch with me through the social media profiles listed in the 'contacts' section.</p>",
  "long-history-text": "<p>My name is Douglas Guimarães, I'm 20 years old, a FullStack programmer, and I'm majoring in Information Systems. I'll tell you a brief story that encapsulates my LOVE for programming. Did I always want to pursue this area? The answer is no. As a child, I wanted to be a firefighter. Curious, isn't it? A completely different profession from what I am today and deeply passionate about. This happened around 2018 or even before. My mom bought a beaten-up laptop from a used store. No battery, just a USB drive. That USB drive would change my life because it contained a Linux distribution called BigLinux. Back then, I didn't even know there was a world of open-source and free software outside of Windows. To me, it was just that, but it wasn't. There was so much more, a whole new world to explore: fascinating ideas, completely captivating concepts, and... it all ended when I tried to use a different power source for the laptop, and it burned out. But that's okay... I suppose. Because the story doesn't end here, years later, my dad bought a brand new laptop straight from the store. I was ecstatic, while my dad was... how parents get when they buy something expensive. Anyway, it was there. A new and beautiful laptop. A quarter of it went to the Windows license, until... the hard drive burned out, and, being the idiot that I am, I decided to open it, thus voiding the warranty. However, let's not jump to conclusions because I couldn't fix it... My dad certainly won't be happy with this information that I just made public. Sorry, Dad. The important thing is: do you remember that USB drive with a Linux distribution? I still have it to this day, and back then, it was much needed. I used the laptop with various live distributions for about two years until I could afford to buy a hard drive with my mom. And after I met Linux, I never left it. Well, I confess, maybe in my second year of high school because I wanted to play Roblox with my friend. But after a week, I came back and never left. And so, after getting to know Linux and interacting with its community and having to use it and learn to live with a 3.5GB temporary hard drive, I decided that this was my path from then on. And today, here I am, aspiring to be a respected Fullstack developer, knowing that a kid who wanted to be a firefighter became a passionate developer, thanks to a technology and two people who are my life.</p>",
  "second-tip": "Tip: Clicking on any card will redirect you to its website.",
  "skills-word": "Skills",
  "skills-word-subtitle": "See the technologies I work with!",
  "javascript-text": "JavaScript is a language used for web development and more!",
  "html-text": "HTML is a markup language used to create the structure of websites!",
  "css-text": "CSS is a cascading style technology used to style HTML documents.",
  "python-text": "Python is a simple and intuitive programming language used worldwide!",
  "typescript-text": "TypeScript is a superset of the JavaScript language. The main difference is that it is strongly typed.",
  "php-text": "PHP is a server-side language used in approximately 80% of all websites!",
  "qt-text": "QT is a C++ framework that allows us to create multi-platform interfaces!",
  "godot-text": "Godot is a robust open-source game engine used in the creation of 2D and 3D games!",
  "docker-text": "Docker is a platform for containerization and deployment!",
  "postgresql-text": "PostgreSQL is a powerful open-source object-relational database system with over 35 years of active development, known for its reliability, robust features, and performance.",
  "bash-text": "Bash is the most widely used shell variant in the world!",
  "linux-text": "Linux is an open-source kernel with approximately 22,000 contributors worldwide!",
  "git-text": "Git is a version control software for development!",
  "node-text": "Node.js is an environment that uses the V8 engine interpreter to run JavaScript outside the browser!",
  "nextjs-text": "Next.js is a JavaScript framework used by many of the world's largest companies.",
  "contact-word": "Contact",
  "contact-subtitle": "Want to hire me? Well, there are several ways to get in touch with me.",
  "linkedin-text": "My LinkedIn is the most formal way to contact me and see my work.",
  "email-text": "This is my Email, another way to contact me!",
  "telegram-text": "My Telegram is more informal, for a more relaxed conversation.",
  "discord-text": "This is my Discord server, mainly for my followers, but feel free to join!",
  "projects-word": "Projects",
  "projects-subtitle": "Here you can see the last 4 public projects that I'm involved on Github! Common, click on them!"
}
