{
  "typedStrings": ["A website.", "A 3D model.", "A mobile app.", "A game."],
  "cappuccino-theme": "☕ &nbsp;Cappuccino Theme",
  "nuovo-moderno-theme": "🎛️ &nbsp;Nuovo Moderno Theme",
  "cioccolato-theme": "🍫 &nbsp;Cioccolato Theme",
  "high-contrast-theme": "👁️‍🗨️ &nbsp;High Contrast Theme",

  "home-header": "Home",
  "home-phrase": "Tell me your idea — I’ll turn it into reality.",
  "first-tip": "Tip: You can customize the site's appearance with themes in the header — including a high-contrast option for better accessibility.",

  "c-highlights": "<b class=\"u-highlight-color\">Highlight</b> projects",

  "about-header": "About",
  "about-section-title": "👨‍💻 Who's Behind the Code?",
  "resume-word": "Résumé",
  "long-history-word": "My Full Story",
  "resume-text": "<p>I'm Douglas Guimarães, 22 years old, from Lima duarte, MG, Brazil. I'm currently pursuing a degree in Information Systems at Estácio de Sá.</p><p>My passion for programming began at 16, and over the past two years, I’ve worked as a freelancer, sharpening my skills as a Fullstack developer. My projects span from 3D modeling to mobile apps—check out the 'Skills' section for the technologies I use.</p><p>I'm also active in the open-source community, having contributed to and created several projects. You can find them on my GitHub. Feel free to reach out through any of the social channels listed under 'Contact'.</p>",
  "long-history-text": "<p>Hey, I’m Douglas Guimarães—22, Fullstack developer, and currently studying Information Systems. Let me tell you how I fell in love with tech. Did I always dream of coding? Not at all. As a kid, I wanted to be a firefighter—totally different from where I ended up. But in 2018, everything changed when my mom bought a used laptop with no battery, just a USB stick. That USB had a Linux distro called BigLinux. At the time, I didn’t even know open-source existed. That laptop opened a whole new world for me—until I fried it by plugging in the wrong charger.</p><p>Years later, my dad bought a brand new laptop. I was over the moon... until the hard drive died. I voided the warranty trying to fix it (sorry, Dad 😅). Thankfully, I still had that USB drive. I ran various Linux distros off of it for nearly two years before finally buying a hard drive with my mom. Since then, Linux and I have been inseparable—except for that one week in high school when I installed Windows just to play Roblox. But I came back!</p><p>Living with Linux taught me resourcefulness, and the community inspired me to keep going. That’s when I realized: this is what I want to do with my life. And today, that curious kid who once wanted to fight fires is building software and chasing the dream of becoming a respected Fullstack developer—thanks to technology, and two incredible people in my life.</p>",
  "second-tip": "Tip: Want to learn more about a project or tool? Just click on any card to explore!",

  "skills-word": "Skills",
  "skills-word-subtitle": "Technologies, frameworks, and tools I use to bring ideas to life.",
  "javascript-text": "JavaScript powers the dynamic behavior of websites and much more!",
  "html-text": "HTML defines the structure and content of web pages.",
  "css-text": "CSS styles your HTML, bringing your site to life.",
  "python-text": "Python is a beginner-friendly language used worldwide in everything from automation to AI.",
  "typescript-text": "TypeScript builds on JavaScript with strong typing and better tooling support.",
  "php-text": "PHP is a battle-tested server-side language that powers a huge part of the web.",
  "qt-text": "Qt is a powerful C++ framework for building cross-platform applications.",
  "godot-text": "Godot is a free and open-source game engine perfect for 2D and 3D games.",
  "docker-text": "Docker lets you package apps with all dependencies and run them anywhere.",
  "postgresql-text": "PostgreSQL is a robust, open-source relational database with decades of development and community trust.",
  "bash-text": "Bash is a powerful shell used to automate and control Linux systems.",
  "linux-text": "Linux is a globally maintained open-source kernel with thousands of contributors.",
  "git-text": "Git is a distributed version control system essential for modern development.",
  "node-text": "Node.js enables you to run JavaScript on the server side using Google’s V8 engine.",
  "nextjs-text": "Next.js is a powerful React framework used by top-tier companies around the world.",

  "certs-word": "Certifications",
  "certs-subtitle": "Recognitions and milestones that reflect my learning journey and expertise.",

  "contact-word": "Let’s Connect",
  "contact-subtitle": "Have a project in mind, a question to ask, or just want to say hi? Here’s how to reach me.",
  "linkedin-text": "LinkedIn is the best place to view my professional experience and reach out formally.",
  "email-text": "Prefer direct contact? Here’s my email.",
  "telegram-text": "Want something more casual? Send me a message on Telegram.",
  "discord-text": "Join my Discord server to chat, connect, and hang out!",

  "projects-word": "Featured Projects",
  "projects-subtitle": "Browse some of my latest public work on GitHub — real code, real passion, real results."
}
