{
  "typedStrings": [
    "Un sitio web.",
    "Un modelo 3D.",
    "Una app móvil.",
    "Un juego."
  ],
  "cappuccino-theme": "☕ &nbsp;Tema Cappuccino",
  "nuovo-moderno-theme": "🎛️ &nbsp;Tema Nuovo Moderno",
  "cioccolato-theme": "🍫 &nbsp;Tema Cioccolato",
  "high-contrast-theme": "👁️‍🗨️ &nbsp;Tema Alto Contraste",

  "home-header": "Inicio",
  "home-phrase": "Cuéntame tu idea — yo la haré realidad.",
  "first-tip": "Consejo: Puedes personalizar la apariencia del sitio con los temas en la parte superior — incluyendo una opción de alto contraste para mejor accesibilidad.",

  "c-highlights": "Proyectos <b class=\"u-highlight-color\">destacados</b>",

  "about-header": "Sobre mí",
  "about-section-title": "👨‍💻 ¿Quién está detrás del código?",
  "resume-word": "Currículum",
  "long-history-word": "Mi Historia Completa",
  "resume-text": "<p>Soy Douglas Guimarães, tengo 22 años y soy de Lima Duarte, MG, Brasil. Actualmente estudio Sistemas de Información en Estácio de Sá.</p><p>Mi pasión por la programación empezó a los 16 años, y en los últimos dos años he trabajado como freelancer, perfeccionando mis habilidades como desarrollador Fullstack. Mis proyectos van desde modelado 3D hasta apps móviles—échale un vistazo a la sección 'Habilidades' para ver las tecnologías que uso.</p><p>También participo activamente en la comunidad de código abierto, contribuyendo y creando varios proyectos. Puedes encontrarlos en mi GitHub. No dudes en contactarme por cualquiera de los canales que aparecen en 'Contacto'.</p>",
  "long-history-text": "<p>¡Hola! Soy Douglas Guimarães—22 años, desarrollador Fullstack, y actualmente estudio Sistemas de Información. Déjame contarte cómo me enamoré de la tecnología. ¿Siempre soñé con programar? Para nada. De niño, quería ser bombero—algo totalmente distinto a donde terminé. Pero en 2018, todo cambió cuando mi mamá compró una laptop usada sin batería, solo con un pendrive. Ese pendrive tenía una distro de Linux llamada BigLinux. En ese momento, ni sabía que el software libre existía. Esa laptop me abrió un mundo nuevo—hasta que la quemé por conectar el cargador equivocado.</p><p>Años después, mi papá compró una laptop nueva. Estaba en las nubes... hasta que se murió el disco duro. Anulé la garantía intentando arreglarla (perdón, papá 😅). Por suerte, aún tenía ese pendrive. Usé varias distros de Linux desde él por casi dos años, hasta que mi mamá me ayudó a comprar un disco duro. Desde entonces, Linux y yo somos inseparables—salvo por esa semana en la secundaria en que instalé Windows solo para jugar Roblox. Pero volví, ¡lo prometo!</p><p>Vivir con Linux me enseñó a ser ingenioso, y la comunidad me inspiró a seguir. Fue entonces cuando entendí: esto es lo que quiero hacer con mi vida. Hoy, aquel chico curioso que soñaba con apagar incendios está construyendo software y persiguiendo el sueño de ser un desarrollador Fullstack respetado—gracias a la tecnología, y a dos personas increíbles en mi vida.</p>",
  "second-tip": "Consejo: ¿Quieres saber más sobre un proyecto o herramienta? Haz clic en cualquier tarjeta para explorar.",

  "skills-word": "Habilidades",
  "skills-word-subtitle": "Tecnologías, frameworks y herramientas que uso para dar vida a las ideas.",
  "javascript-text": "JavaScript da vida al comportamiento dinámico de los sitios web ¡y mucho más!",
  "html-text": "HTML define la estructura y el contenido de las páginas web.",
  "css-text": "CSS le da estilo a tu HTML, haciendo que tu sitio cobre vida.",
  "python-text": "Python es un lenguaje amigable usado en todo el mundo, desde automatización hasta inteligencia artificial.",
  "typescript-text": "TypeScript amplía JavaScript con tipado fuerte y mejor soporte para herramientas.",
  "php-text": "PHP es un lenguaje de servidor veterano que potencia gran parte de la web.",
  "qt-text": "Qt es un potente framework en C++ para crear aplicaciones multiplataforma.",
  "godot-text": "Godot es un motor de juegos libre y de código abierto, ideal para juegos 2D y 3D.",
  "docker-text": "Docker te permite empaquetar apps con todas sus dependencias y ejecutarlas en cualquier lugar.",
  "postgresql-text": "PostgreSQL es una base de datos relacional robusta y de código abierto, con décadas de desarrollo y confianza.",
  "bash-text": "Bash es un shell poderoso para automatizar y controlar sistemas Linux.",
  "linux-text": "Linux es un kernel de código abierto mantenido globalmente, con miles de colaboradores.",
  "git-text": "Git es un sistema de control de versiones distribuido, esencial para el desarrollo moderno.",
  "node-text": "Node.js te permite ejecutar JavaScript del lado del servidor usando el motor V8 de Google.",
  "nextjs-text": "Next.js es un potente framework de React utilizado por empresas de primer nivel en todo el mundo.",

  "certs-word": "Certificaciones",
  "certs-subtitle": "Reconocimientos y logros que reflejan mi camino de aprendizaje y experiencia.",

  "contact-word": "Conectemos",
  "contact-subtitle": "¿Tienes una idea, una pregunta o solo quieres saludar? Aquí te dejo mis contactos.",
  "linkedin-text": "LinkedIn es el mejor lugar para ver mi experiencia profesional y contactarme formalmente.",
  "email-text": "¿Prefieres algo directo? Aquí está mi correo electrónico.",
  "telegram-text": "¿Algo más casual? Mándame un mensaje por Telegram.",
  "discord-text": "Únete a mi servidor de Discord para charlar, conectar y pasar el rato.",

  "projects-word": "Proyectos Destacados",
  "projects-subtitle": "Explora algunos de mis últimos trabajos públicos en GitHub — código real, pasión real, resultados reales."
}
