{
  "typedStrings": [
    "Un sitio web.",
    "Un modelo 3D.",
    "Una aplicación móvil.",
    "Un videojuego."
  ],
  "cappuccino-theme": "☕ &nbsp;Tema Cappuccino",
  "cioccolato-theme": "🍫 &nbsp;Tema Cioccolato",
  "high-contrast-theme": "👁️‍🗨️ &nbsp;Tema de Alto Contraste",
  "home-header": "Inicio",
  "home-phrase": "¿En qué puedo ayudarte?",
  "first-tip": "Consejo: Hay algunos temas que se pueden elegir en el encabezado, incluido uno de alto contraste.",

  "about-header": "Acerca de",
  "about-section-title": "Sobre mí",
  "resume-word": "Currículum",
  "long-history-word": "Historia Larga...",
  "resume-text": "<p>Soy Douglas Guimarães, tengo 20 años y soy de Juiz de Fora, MG, Brasil. Actualmente, estoy estudiando Informática en Estácio de Sá.</p><p>Tengo pasión por la programación desde los 16 años y, en los últimos 2 años, he trabajado como freelance, perfeccionando mis habilidades profesionales. Soy un desarrollador Fullstack y trabajo en diversos tipos de proyectos, desde modelado 3D hasta desarrollo de aplicaciones móviles (consulta la sección 'habilidades' para conocer las tecnologías que utilizo).</p><p>También he participado y creado algunos proyectos de código abierto (puedes encontrar su código en mi GitHub). No dudes en ponerte en contacto conmigo a través de los perfiles de redes sociales que se mencionan en la sección 'contactos'.</p>",
  "long-history-text": "<p>Me llamo Douglas Guimarães, tengo 20 años, soy programador FullStack y estoy estudiando Informática. Te contaré una breve historia que resume mi AMOR por la programación. ¿Siempre quise seguir esta área? La respuesta es no. De niño, quería ser bombero. Curioso, ¿verdad? Una profesión completamente diferente a la que soy hoy y profundamente apasionado. Esto ocurrió alrededor de 2018 o incluso antes. Mi madre compró un portátil desgastado en una tienda de segunda mano. Sin batería, solo una memoria USB. Esa memoria USB cambiaría mi vida, ya que contenía una distribución de Linux llamada BigLinux. En ese momento, ni siquiera sabía que existía un mundo de software libre y de código abierto fuera de Windows. Para mí, era solo eso, pero no lo era. Había mucho más, un mundo entero por explorar: ideas fascinantes, conceptos completamente cautivadores y... todo terminó cuando intenté usar una fuente de alimentación diferente para el portátil y se quemó. Pero está bien... supongo. Porque la historia no termina aquí, años después, mi padre compró un portátil nuevo directamente desde la tienda. Yo estaba emocionado, mientras que mi padre... como los padres se ponen cuando compran algo caro. De todos modos, estaba allí. Un portátil nuevo y hermoso. Un cuarto de él fue para la licencia de Windows, hasta que... el disco duro se quemó y, siendo el tonto que soy, decidí abrirlo, anulando la garantía. Sin embargo, no saquemos conclusiones precipitadas porque no pude arreglarlo... Mi padre seguramente no estará contento con esta información que acabo de hacer pública. Lo siento, papá. Lo importante es: ¿recuerdas esa memoria USB con una distribución de Linux? Todavía la tengo hasta el día de hoy y en ese momento era muy necesaria. Usé el portátil con varias distribuciones en vivo durante aproximadamente dos años hasta que pude comprar un disco duro con mi madre. Y después de conocer Linux e interactuar con su comunidad y tener que usarlo y aprender a vivir con un disco duro temporal de 3,5 GB, decidí que este era mi camino a partir de entonces. Y hoy, aquí estoy, aspirando a ser un respetado desarrollador Fullstack, sabiendo que un niño que quería ser bombero se convirtió en un desarrollador apasionado, gracias a una tecnología y dos personas que son mi vida.</p>",
  "second-tip": "Consejo: Hacer clic en cualquier tarjeta te redirigirá a su sitio web.",
  "skills-word": "Habilidades",
  "skills-word-subtitle": "¡Mira las tecnologías con las que trabajo!",
  "javascript-text": "JavaScript es un lenguaje utilizado para el desarrollo web y mucho más!",
  "html-text": "HTML es un lenguaje de marcado utilizado para crear la estructura de sitios web!",
  "css-text": "CSS es una tecnología de estilo en cascada utilizada para dar estilo a los documentos HTML.",
  "python-text": "Python es un lenguaje de programación simple e intuitivo utilizado en todo el mundo!",
  "typescript-text": "TypeScript es una extensión del lenguaje JavaScript. La principal diferencia es que es fuertemente tipado.",
  "php-text": "PHP es un lenguaje de servidor utilizado en aproximadamente el 80% de todos los sitios web!",
  "qt-text": "QT es un marco de C++ que nos permite crear interfaces multiplataforma!",
  "godot-text": "Godot es un potente motor de juegos de código abierto utilizado en la creación de juegos 2D y 3D!",
  "docker-text": "Docker es una plataforma para la contenerización y despliegue!",
  "postgresql-text": "PostgreSQL es un potente sistema de base de datos relacional de código abierto con más de 35 años de desarrollo activo, conocido por su confiabilidad, características robustas y rendimiento.",
  "bash-text": "Bash es la variante de shell más utilizada en el mundo!",
  "linux-text": "Linux es un kernel de código abierto con aproximadamente 22,000 colaboradores en todo el mundo!",
  "git-text": "Git es un software de control de versiones para desarrollo!",
  "node-text": "Node.js es un entorno que utiliza el intérprete del motor V8 para ejecutar JavaScript fuera del navegador!",
  "nextjs-text": "Next.js es un marco de JavaScript utilizado por muchas de las empresas más grandes del mundo.",
  "contact-word": "Contacto",
  "contact-subtitle": "¿Quieres contratarme? Bueno, hay varias formas de ponerse en contacto conmigo.",
  "linkedin-text": "Mi LinkedIn es la forma más formal de ponerse en contacto conmigo y ver mi trabajo.",
  "email-text": "Este es mi correo electrónico, otra forma de ponerse en contacto conmigo!",
  "telegram-text": "Mi Telegram es más informal, para una conversación más relajada.",
  "discord-text": "Este es mi servidor de Discord, principalmente para mis seguidores, ¡pero siéntete libre de unirte!",
  "projects-word": "Proyectos",
  "projects-subtitle": "¡Aquí puedes ver los últimos 4 proyectos públicos en los que estoy involucrado en Github! ¡Vamos, haz clic en ellos!"
}
