{
  "home-header": "Inicio",
  "first-tip": "Consejo: hay varios temas que puedes elegir en el encabezado, incluido uno de alto contraste.",

  "about-header": "Acerca de",
  "about-section-title": "Acerca de mí",
  "second-tip": "Consejo: al hacer clic en cualquier tarjeta, serás redirigido a su sitio web <i class=\"u-mobile__displayIt\">o presiónalo para obtener más información</i>.",
  "skills-word": "Habilidades",
  "skills-word-subtitle": "¡Mira las tecnologías con las que trabajo!",
  "javascript-text": "JavaScript es un lenguaje utilizado para el desarrollo web y más.",
  "html-text": "HTML es un lenguaje de marcado utilizado para crear la estructura de sitios web.",
  "css-text": "CSS es una tecnología de estilo en cascada utilizada para dar estilo a documentos HTML.",
  "python-text": "Python es un lenguaje de programación simple e intuitivo utilizado en todo el mundo.",
  "typescript-text": "TypeScript es un superset del lenguaje JavaScript. La principal diferencia es que es fuertemente tipado.",
  "php-text": "PHP es un lenguaje del lado del servidor utilizado en aproximadamente el 80% de todos los sitios web.",
  "qt-text": "Qt es un marco de C++ que nos permite crear interfaces multiplataforma.",
  "godot-text": "Godot es un potente motor de juegos de código abierto utilizado en la creación de juegos 2D y 3D.",
  "docker-text": "Docker es una plataforma para la contenerización y la implementación.",
  "postgresql-text": "PostgreSQL es un potente sistema de base de datos relacional de código abierto con más de 35 años de desarrollo activo que ha ganado una sólida reputación por su confiabilidad, características robustas y rendimiento.",
  "bash-text": "Bash es la variante de shell más utilizada en el mundo.",
  "linux-text": "Linux es un kernel de código abierto con aproximadamente 22,000 contribuyentes en todo el mundo.",
  "git-text": "Git es un software de control de versiones para desarrollo.",
  "node-text": "Node.js es un entorno que utiliza el intérprete V8 engine para ejecutar JavaScript fuera del navegador.",
  "nextjs-text": "Next.js es un marco de JavaScript utilizado por muchas de las empresas más grandes del mundo.",
  "contact-word": "Contacto",
  "contact-subtitle": "¿Deseas contratarme? Bueno, existen varias formas de ponerse en contacto conmigo.",
  "linkedin-text": "Mi LinkedIn es la forma más formal de ponerse en contacto conmigo y ver mi trabajo.",
  "email-text": "Este es mi correo electrónico, otra forma de ponerse en contacto conmigo.",
  "telegram-text": "Mi Telegram es más informal, para una conversación más relajada.",
  "discord-text": "Este es mi servidor de Discord, principalmente para mis seguidores, ¡pero siéntete libre de unirte!",
  "social-word": "Redes sociales",
  "social-subtitle": "Aquí puedes ver mis redes sociales, donde creo contenido sobre desarrollo de una manera divertida y relajada."
}
