{
  "typedStrings": [
    "Un sitio web.",
    "Un modelo 3D.",
    "Una aplicación móvil.",
    "Un juego.",
    "El backend de tu aplicación."
  ],
  "cappuccino-theme": "☕ &nbsp;tema cappuccino",
  "cioccolato-theme": "🍫 &nbsp;tema cioccolato",
  "high-contrast-theme": "👁️‍🗨️ &nbsp;tema de alto contraste",
  "home-header": "Inicio",
  "home-phrase": "¿En qué puedo ayudarte?",
  "first-tip": "Consejo: Hay algunos temas que se pueden elegir en el encabezado, incluyendo uno de alto contraste.",

  "about-header": "Acerca de",
  "about-section-title": "Acerca de mí",
  "professional-word": "Profesional",
  "long-history-word": "Larga historia",
  "professional-text": "<p>Soy Douglas Guimarães, tengo 20 años y soy originario de Juiz de Fora, MG, Brasil. Actualmente, estoy cursando la carrera de Sistemas de Información en Estácio de Sá. </p><p>Tengo una pasión por la programación desde los 16 años y, en los últimos 2 años, he trabajado como freelancer, perfeccionando mis habilidades profesionales. Soy un desarrollador Fullstack y trabajo en diversos tipos de proyectos, desde modelado 3D hasta desarrollo de aplicaciones móviles (consulta la sección 'habilidades' para conocer las tecnologías que utilizo).</p><p>También he participado y creado algunos proyectos de código abierto (puedes encontrar su código en mi GitHub). No dudes en ponerte en contacto conmigo a través de los perfiles de redes sociales que se detallan en la sección 'contactos'.</p>",
  "long-history-text": "<p>Me llamo Douglas Guimarães, tengo 20 años, soy un programador FullStack y estoy cursando una licenciatura en Sistemas de Información. Te contaré una breve historia que encapsula mi AMOR por la programación. ¿Siempre quise seguir esta área? La respuesta es no. De niño, quería ser bombero. ¡Curioso, ¿verdad? Una profesión completamente diferente a lo que soy hoy y de la que estoy profundamente apasionado. Esto sucedió alrededor de 2018 o incluso antes. Mi madre compró un portátil desgastado en una tienda de segunda mano. Sin batería, solo una memoria USB. Esa memoria USB cambiaría mi vida porque contenía una distribución de Linux llamada BigLinux. En ese momento, ni siquiera sabía que existía un mundo de software de código abierto y gratuito fuera de Windows. Para mí, era solo eso, pero no lo era. Había mucho más, un mundo completamente nuevo por explorar: ideas fascinantes, conceptos completamente cautivadores y... todo terminó cuando intenté usar una fuente de alimentación diferente para el portátil y se quemó. Pero eso está bien... supongo. Porque la historia no termina aquí, años después, mi padre compró un portátil nuevo directamente en la tienda. Yo estaba extasiado, mientras que mi padre estaba... como los padres se ponen cuando compran algo caro. De todos modos, ahí estaba. Un portátil nuevo y hermoso. Un cuarto de él se destinó a la licencia de Windows, hasta que... el disco duro se quemó y, siendo el idiota que soy, decidí abrirlo, anulando así la garantía. Sin embargo, no saquemos conclusiones precipitadas porque no pude arreglarlo... Seguro que a mi padre no le gustará esta información que acabo de hacer pública. Lo siento, papá. Lo importante es: ¿recuerdas esa memoria USB con una distribución de Linux? Todavía la tengo hasta el día de hoy, y en ese momento era muy necesaria. Utilicé el portátil con varias distribuciones en vivo durante unos dos años hasta que pude comprar un disco duro con mi madre. Y después de conocer Linux, nunca lo abandoné. Bueno, confieso que tal vez en mi segundo año de secundaria porque quería jugar a Roblox con un amigo. Pero después de una semana, volví y nunca me fui. Y así, después de conocer Linux, interactuar con su comunidad y tener que usarlo y aprender a vivir con un disco duro temporal de 3,5 GB, decidí que este sería mi camino a partir de entonces. Y hoy, aquí estoy, aspirando a ser un respetado desarrollador Fullstack, sabiendo que un niño que quería ser bombero se convirtió en un apasionado desarrollador, gracias a una tecnología y dos personas que son mi vida.</p>",
  "second-tip": "Consejo: Haciendo clic en cualquier tarjeta te redirigirá a su sitio web.",
  "skills-word": "Habilidades",
  "skills-word-subtitle": "¡Mira las tecnologías con las que trabajo!",
  "javascript-text": "JavaScript es un lenguaje utilizado para el desarrollo web y más.",
  "html-text": "HTML es un lenguaje de marcado utilizado para crear la estructura de sitios web.",
  "css-text": "CSS es una tecnología de estilo en cascada utilizada para dar estilo a documentos HTML.",
  "python-text": "Python es un lenguaje de programación simple e intuitivo utilizado en todo el mundo.",
  "typescript-text": "TypeScript es una superconjunto del lenguaje JavaScript. La principal diferencia es que es fuertemente tipado.",
  "php-text": "PHP es un lenguaje de servidor utilizado en aproximadamente el 80% de todos los sitios web.",
  "qt-text": "QT es un marco de C++ que nos permite crear interfaces multiplataforma.",
  "godot-text": "Godot es un motor de juego robusto y de código abierto utilizado en la creación de juegos 2D y 3D.",
  "docker-text": "Docker es una plataforma para la contenerización y implementación.",
  "postgresql-text": "PostgreSQL es un poderoso sistema de base de datos relacional de código abierto con más de 35 años de desarrollo activo, conocido por su confiabilidad, características robustas y rendimiento.",
  "bash-text": "Bash es la variante de shell más utilizada en el mundo.",
  "linux-text": "Linux es un núcleo de código abierto con aproximadamente 22,000 colaboradores en todo el mundo.",
  "git-text": "Git es un software de control de versiones para desarrollo.",
  "node-text": "Node.js es un entorno que utiliza el intérprete del motor V8 para ejecutar JavaScript fuera del navegador.",
  "nextjs-text": "Next.js es un marco de JavaScript utilizado por muchas de las empresas más grandes del mundo.",
  "contact-word": "Contacto",
  "contact-subtitle": "¿Quieres contratarme? Bueno, hay varias formas de ponerse en contacto conmigo.",
  "linkedin-text": "Mi LinkedIn es la forma más formal de ponerse en contacto conmigo y ver mi trabajo.",
  "email-text": "Este es mi correo electrónico, otra forma de ponerse en contacto conmigo.",
  "telegram-text": "Mi Telegram es más informal, para una conversación más relajada.",
  "discord-text": "Este es mi servidor de Discord, principalmente para mis seguidores, ¡pero siéntete libre de unirte!",
  "projects-word": "Proyectos",
  "projects-subtitle": "Aquí puedes ver mis proyectos, donde creo contenido sobre desarrollo de manera humorística y relajada."
}
