{
  "typedStrings": ["Um site.", "Um modelo 3D.", "Um app mobile.", "Um jogo."],
  "cappuccino-theme": "☕ &nbsp;Tema Cappuccino",
  "nuovo-moderno-theme": "🎛️ &nbsp;Tema Nuovo Moderno",
  "cioccolato-theme": "🍫 &nbsp;Tema Cioccolato",
  "high-contrast-theme": "👁️‍🗨️ &nbsp;Tema Alto Contraste",

  "home-header": "Início",
  "home-phrase": "Me conte sua ideia — eu vou transformá-la em realidade.",
  "first-tip": "Dica: Você pode personalizar a aparência do site usando os temas no topo — incluindo uma opção de alto contraste para melhor acessibilidade.",

  "c-highlights": "Projetos de <b class=\"u-highlight-color\">destaque</b>",
  "about-header": "Sobre",
  "about-section-title": "👨‍💻 Quem Está Por Trás do Código?",
  "resume-word": "Currículo",
  "long-history-word": "Minha História Completa",
  "resume-text": "<p>Sou Douglas Guimarães, tenho 22 anos e sou de Lima Duarte, MG, Brasil. Atualmente curso Sistemas de Informação na Estácio de Sá.</p><p>Minha paixão por programação começou aos 16 anos, e nos últimos dois anos atuei como freelancer, aprimorando minhas habilidades como desenvolvedor Fullstack. Meus projetos vão desde modelagem 3D até aplicativos mobile — veja a seção 'Habilidades' para conhecer as tecnologias que uso.</p><p>Também sou ativo na comunidade open source, contribuindo e criando diversos projetos. Você pode encontrá-los no meu GitHub. Fique à vontade para entrar em contato por qualquer canal listado na seção 'Contato'.</p>",
  "long-history-text": "<p>Oi! Eu sou o Douglas Guimarães — 22 anos, desenvolvedor Fullstack e estudante de Sistemas de Informação. Deixa eu te contar como me apaixonei por tecnologia. Sempre sonhei em programar? Nem de longe. Quando criança, queria ser bombeiro — totalmente diferente de onde fui parar. Mas em 2018, tudo mudou quando minha mãe comprou um notebook usado sem bateria, apenas com um pendrive. Esse pendrive tinha uma distro Linux chamada BigLinux. Na época, eu nem sabia que software livre existia. Esse notebook abriu um novo mundo pra mim — até eu queimar ele usando o carregador errado.</p><p>Anos depois, meu pai comprou um notebook novinho. Fiquei radiante... até o HD queimar. Perdi a garantia tentando consertar (foi mal, pai 😅). Por sorte, ainda tinha aquele pendrive. Usei várias distros Linux nele por quase dois anos até finalmente comprar um HD junto com minha mãe. Desde então, eu e o Linux somos inseparáveis — tirando aquela semana no ensino médio em que instalei o Windows só pra jogar Roblox. Mas eu voltei!</p><p>Viver com Linux me ensinou a ser criativo, e a comunidade me inspirou a continuar. Foi aí que percebi: é isso que quero fazer da vida. Hoje, aquele garoto curioso que queria apagar incêndios está construindo software e correndo atrás do sonho de ser um desenvolvedor Fullstack respeitado — graças à tecnologia e a duas pessoas incríveis na minha vida.</p>",

  "second-tip": "Dica: Quer saber mais sobre algum projeto ou ferramenta? É só clicar em qualquer cartão para explorar!",

  "skills-word": "Habilidades",
  "skills-word-subtitle": "Tecnologias, frameworks e ferramentas que uso para dar vida às ideias.",
  "javascript-text": "JavaScript dá vida ao comportamento dinâmico dos sites — e muito mais!",
  "html-text": "HTML define a estrutura e o conteúdo das páginas web.",
  "css-text": "CSS estiliza seu HTML, dando vida ao seu site.",
  "python-text": "Python é uma linguagem amigável, usada no mundo todo — de automações até IA.",
  "typescript-text": "TypeScript expande o JavaScript com tipagem forte e melhor suporte a ferramentas.",
  "php-text": "PHP é uma linguagem consolidada no backend, que alimenta boa parte da web.",
  "qt-text": "Qt é um poderoso framework C++ para criação de apps multiplataforma.",
  "godot-text": "Godot é um motor de jogos gratuito e open source, perfeito para games 2D e 3D.",
  "docker-text": "Docker permite empacotar apps com todas as dependências e rodá-las em qualquer lugar.",
  "postgresql-text": "PostgreSQL é um banco de dados relacional robusto e open source, com décadas de confiança.",
  "bash-text": "Bash é um shell poderoso usado para automatizar e controlar sistemas Linux.",
  "linux-text": "Linux é um kernel open source mantido globalmente por milhares de colaboradores.",
  "git-text": "Git é um sistema de controle de versão distribuído, essencial no desenvolvimento moderno.",
  "node-text": "Node.js permite rodar JavaScript no servidor com o motor V8 do Google.",
  "nextjs-text": "Next.js é um framework poderoso do React, usado por empresas de alto nível no mundo inteiro.",

  "certs-word": "Certificações",
  "certs-subtitle": "Reconhecimentos e marcos que refletem minha jornada de aprendizado e experiência.",

  "contact-word": "Vamos nos Conectar",
  "contact-subtitle": "Tem uma ideia, uma dúvida ou só quer bater um papo? Veja como me encontrar.",
  "linkedin-text": "O LinkedIn é o melhor lugar pra ver minha experiência profissional e entrar em contato formalmente.",
  "email-text": "Prefere um contato direto? Aqui está meu e-mail.",
  "telegram-text": "Quer algo mais informal? Me manda uma mensagem no Telegram.",
  "discord-text": "Entre no meu servidor do Discord para conversar, interagir e trocar ideias!",

  "projects-word": "Projetos em Destaque",
  "projects-subtitle": "Explore alguns dos meus últimos projetos públicos no GitHub — código real, paixão real, resultados reais."
}
