{
  "typedStrings": [
    "Um site.",
    "Um modelo 3D.",
    "Um aplicativo móvel.",
    "Um jogo."
  ],
  "cappuccino-theme": "☕ &nbsp;Tema Cappuccino",
  "cioccolato-theme": "🍫 &nbsp;Tema Cioccolato",
  "high-contrast-theme": "👁️‍🗨️ &nbsp;Tema de Alto Contraste",
  "home-header": "Início",
  "home-phrase": "No que posso ajudar você?",
  "first-tip": "Dica: Existem alguns temas que podem ser escolhidos no cabeçalho, incluindo um de alto contraste.",

  "about-header": "Sobre",
  "about-section-title": "Sobre Mim",
  "resume-word": "Currículo",
  "long-history-word": "História Longa...",
  "resume-text": "<p>Meu nome é Douglas Guimarães, tenho 20 anos e sou de Juiz de Fora, MG, Brasil. Atualmente, estou cursando Sistemas de Informação na Estácio de Sá.</p><p>Tenho paixão pela programação desde os 16 anos e, nos últimos 2 anos, tenho trabalhado como freelancer, aprimorando minhas habilidades profissionais. Sou desenvolvedor Fullstack e trabalho em vários tipos de projetos, desde modelagem 3D até desenvolvimento de aplicativos móveis (veja a seção 'habilidades' para entender as tecnologias que utilizo).</p><p>Também participei e criei alguns projetos de código aberto (você pode encontrar o código deles no meu GitHub). Sinta-se à vontade para entrar em contato comigo através dos perfis de redes sociais listados na seção 'contatos'.</p>",
  "long-history-text": "<p>Meu nome é Douglas Guimarães, tenho 20 anos, sou programador FullStack e estou cursando Sistemas de Informação. Vou contar uma breve história que encapsula meu AMOR pela programação. Será que sempre quis seguir essa área? A resposta é não. Quando criança, queria ser bombeiro. Curioso, não é? Uma profissão completamente diferente do que sou hoje e profundamente apaixonado. Isso aconteceu por volta de 2018 ou até antes. Minha mãe comprou um laptop surrado em uma loja de usados. Sem bateria, apenas um pen drive. Esse pen drive mudaria minha vida, pois continha uma distribuição Linux chamada BigLinux. Naquela época, nem sabia que havia um mundo de software livre e de código aberto fora do Windows. Para mim, era apenas isso, mas não era. Havia muito mais, um mundo todo a ser explorado: ideias fascinantes, conceitos completamente cativantes e... tudo terminou quando tentei usar uma fonte de energia diferente para o laptop, e ele queimou. Mas tudo bem... suponho. Porque a história não termina aqui, anos depois, meu pai comprou um laptop novinho em folha direto da loja. Eu estava extasiado, enquanto meu pai estava... como os pais ficam quando compram algo caro. De qualquer forma, estava lá. Um laptop novo e bonito. Um quarto dele foi para a licença do Windows, até... o disco rígido queimou, e, sendo o idiota que sou, decidi abri-lo, anulando assim a garantia. No entanto, não vamos tirar conclusões precipitadas porque não consegui consertá-lo... Meu pai certamente não ficará feliz com essa informação que acabei de tornar pública. Desculpe, pai. O importante é: você se lembra daquele pen drive com uma distribuição Linux? Eu ainda o tenho até hoje, e naquela época, ele era muito necessário. Usei o laptop com várias distribuições ao vivo por cerca de dois anos, até poder comprar um disco rígido com minha mãe. E depois de conhecer o Linux e interagir com sua comunidade e ter que usá-lo e aprender a conviver com um disco rígido temporário de 3,5GB, decidi que este era meu caminho a partir de então. E hoje, aqui estou eu, aspirando a ser um respeitado desenvolvedor Fullstack, sabendo que um garoto que queria ser bombeiro se tornou um desenvolvedor apaixonado, graças a uma tecnologia e duas pessoas que são minha vida.</p>",
  "second-tip": "Dica: Clicar em qualquer cartão redirecionará você para seu site.",
  "skills-word": "Habilidades",
  "skills-word-subtitle": "Veja as tecnologias com as quais trabalho!",
  "javascript-text": "JavaScript é uma linguagem usada para desenvolvimento web e muito mais!",
  "html-text": "HTML é uma linguagem de marcação usada para criar a estrutura de sites!",
  "css-text": "CSS é uma tecnologia de estilo em cascata usada para estilizar documentos HTML.",
  "python-text": "Python é uma linguagem de programação simples e intuitiva usada em todo o mundo!",
  "typescript-text": "TypeScript é uma extensão da linguagem JavaScript. A principal diferença é que é fortemente tipada.",
  "php-text": "PHP é uma linguagem de servidor usada em cerca de 80% de todos os sites!",
  "qt-text": "QT é um framework em C++ que nos permite criar interfaces multiplataforma!",
  "godot-text": "Godot é uma poderosa engine de jogo de código aberto usada na criação de jogos 2D e 3D!",
  "docker-text": "Docker é uma plataforma para containerização e implantação!",
  "postgresql-text": "PostgreSQL é um poderoso sistema de banco de dados relacional de código aberto com mais de 35 anos de desenvolvimento ativo, conhecido por sua confiabilidade, recursos robustos e desempenho.",
  "bash-text": "Bash é a variante de shell mais amplamente usada no mundo!",
  "linux-text": "Linux é um kernel de código aberto com aproximadamente 22.000 colaboradores em todo o mundo!",
  "git-text": "Git é um software de controle de versão para desenvolvimento!",
  "node-text": "Node.js é um ambiente que utiliza o interpretador V8 para executar JavaScript fora do navegador!",
  "nextjs-text": "Next.js é um framework JavaScript usado por muitas das maiores empresas do mundo.",
  "contact-word": "Contato",
  "contact-subtitle": "Quer me contratar? Bem, existem várias maneiras de entrar em contato comigo.",
  "linkedin-text": "Meu LinkedIn é a forma mais formal de entrar em contato comigo e ver meu trabalho.",
  "email-text": "Este é meu e-mail, outra maneira de entrar em contato comigo!",
  "telegram-text": "Meu Telegram é mais informal, para uma conversa mais descontraída.",
  "discord-text": "Este é o meu servidor no Discord, principalmente para meus seguidores, mas sinta-se à vontade para participar!",
  "projects-word": "Projetos",
  "projects-subtitle": "Aqui você pode ver os últimos 4 projetos públicos dos quais estou envolvido no Github! Vamos lá, clique neles!"
}
