{
  "home-header": "ínicio",
  "first-tip": "Dica: existem alguns temas que podem ser escolhidos no cabeçalho, incluindo um de alto contraste.",

  "about-header": "Sobre",
  "about-section-title": "Sobre mim",
  "second-tip": "Dica: clicando em qualquer card você será redirecionado à seu site<i class=\"u-mobile__displayIt\"> ou pressione-o para mais informações</i>.",
  "skills-word": "Skills",
  "skills-word-subtitle": "Veja as tecnologias com que eu trabalho!",
  "javascript-text": "O Javascript é uma linguagem usada para desenvolvimento web e afins! ",
  "html-text": "O HTML é uma linguagem de marcação usada para criar a estrutura de websites!",
  "css-text": "O CSS é uma tecnologia de estilo em cascata usada para estilizar documentos HTML",
  "python-text": "O Python é uma linguagem de programação simples e intuítiva usada no mundo todo!",
  "typescript-text": "O TypeScript é um superset da linguagem javascript. A principal diferença é  ela ser uma  fortemente tipada. ",
  "php-text": "O PHP é uma linguagem server-side usada em aproximadamente 80% de todos os websites!",
  "qt-text": "O QT é um framework c++  que nos possibilita criar interfaces multi-plataforma!",
  "godot-text": "A Godot é uma engine de jogos robusta e de código aberto usada na criação de jogos 2D e 3D!",
  "docker-text": "O Docker é uma plataforma para a conteinerização e implementação!",
  "postgresql-text": "PostgreSQL é um poderoso software relacional de objeto de código aberto  sistema de banco de dados com mais de 35 anos de desenvolvimento ativo que ganhou uma forte reputação de confiabilidade, recursos robustez e desempenho.",
  "bash-text": "O Bash é a variante do shell mais ultilizada no mundo!",
  "linux-text": "Linux é um kernel open-source com aproximadamente 22.000 contribuidores pelo mundo!",
  "git-text": "O Git é um software para desenvolvimento de controle de versionamento!",
  "node-text": "Node.js é um ambiente que ultiliza o interpretador  V8 engine para executar javascript fora do navegador! ",
  "nextjs-text": "Next.js é um framework javascript usado em muitas das maiores empresas do mundo.",
  "contact-word": "Contato",
  "contact-subtitle": "Deseja me contratar ? Bom, existem algumas maneira de entrar em contato comigo. ",
  "linkedin-text": "Meu Linkedin é a forma mais formal de entrar em contato comigo e ver meu trabalho.",
  "email-text": "Esse é o meu Email, que é outra forma de entrar em contato comigo! ",
  "telegram-text": "O meu Telegram é mais informal, para uma conversa mais descontraída.",
  "discord-text": "Este é o meu servidor do Discord, é principalmente para meu seguidores, mas sinta-se a vontade para entrar lá!",
  "social-word": "Redes sociais"
}
